/* file name : Work3_3.cpp
* Cтудент : Держій Денис Юрійович
* Група : КН – 1 - 2
* Дата створення : 25 / 10 / 2022
* Дата останньої зміни : 25 / 10 / 2022
* Лабораторна робота №3
* Тема : Алгоритмізація та програмування задач циклічної структури.Цикл з параметром
* Завдання : Знайти добуток усіх чисел кратних трьом в заданому діапазоні. Вивести усі числа, що задовольняють вказаній умові, а також добуток та кількість таких чисел.
*/

#include <math.h>
#include <iostream>
#include <stdio.h>
#include <windows.h>
using namespace std;

int main()
{
	system("cls");
	setlocale(LC_ALL, "Ukr");
	int k = 1;
	float x_st, x_end, dob{1}, x, x_pr = 1;
	cout << "Введіть інтервал чисел\n";
	cout << "Введіть початок інтервалу =";
	cin >> x_st;
	cout << "Введіть кінець інтервалу =";
	cin >> x_end;
	for (x = x_st; x <= x_end; x = x + x_pr)
	{
		if ((fmod(x, 3)) == 0)
		{
			cout << "Число, які задовільняє умову = " << x << endl;
			dob = dob * x;
			k++;
		}
	}
	cout << "Добуток= " << dob << endl;
	cout << "Кількість= " << k << endl;
	system("pause");
	return 0;

}